Conditions for wall embedding are no longer satisfied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId EmbeddedButShouldNotBe { get; }
  Visual Basic
Public Shared ReadOnly Property EmbeddedButShouldNotBe As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ EmbeddedButShouldNotBe {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace